SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fft.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 FFT register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_FFT_H
#define EFR32FG25_FFT_H
#define FFT_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_FFT FFT
 * @{
 * @brief EFR32FG25 FFT Register Declaration.
 *****************************************************************************/

/** FFT Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable Clocks                                     */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN;                         /**< New Register                                       */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT;                        /**< New Register                                       */
  uint32_t       RESERVED4[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  __IOM uint32_t CTRL2;                         /**< New Register                                       */
  __IOM uint32_t IF;                            /**< Interrupt Flags                                    */
  __IOM uint32_t IEN;                           /**< Interrupt Enable                                   */
  uint32_t       RESERVED5[892U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED7[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED8[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_SET;                     /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED10[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  __IOM uint32_t CTRL2_SET;                     /**< New Register                                       */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable                                   */
  uint32_t       RESERVED11[892U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED12[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED14[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED15[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED16[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  __IOM uint32_t CTRL2_CLR;                     /**< New Register                                       */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable                                   */
  uint32_t       RESERVED17[892U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED20[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_TGL;                     /**< New Register                                       */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED22[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
  __IOM uint32_t CTRL2_TGL;                     /**< New Register                                       */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable                                   */
} FFT_TypeDef;
/** @} End of group EFR32FG25_FFT */

/**************************************************************************//**
 * @addtogroup EFR32FG25_FFT
 * @{
 * @defgroup EFR32FG25_FFT_BitFields FFT Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for FFT IPVERSION */
#define _FFT_IPVERSION_RESETVALUE                  0x00000001UL                            /**< Default value for FFT_IPVERSION             */
#define _FFT_IPVERSION_MASK                        0xFFFFFFFFUL                            /**< Mask for FFT_IPVERSION                      */
#define _FFT_IPVERSION_IPVERSION_SHIFT             0                                       /**< Shift value for FFT_IPVERSION               */
#define _FFT_IPVERSION_IPVERSION_MASK              0xFFFFFFFFUL                            /**< Bit mask for FFT_IPVERSION                  */
#define _FFT_IPVERSION_IPVERSION_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for FFT_IPVERSION              */
#define FFT_IPVERSION_IPVERSION_DEFAULT            (_FFT_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for FFT_IPVERSION      */

/* Bit fields for FFT EN */
#define _FFT_EN_RESETVALUE                         0x00000000UL                         /**< Default value for FFT_EN                    */
#define _FFT_EN_MASK                               0x00000003UL                         /**< Mask for FFT_EN                             */
#define FFT_EN_EN                                  (0x1UL << 0)                         /**< Module Enable                               */
#define _FFT_EN_EN_SHIFT                           0                                    /**< Shift value for FFT_EN                      */
#define _FFT_EN_EN_MASK                            0x1UL                                /**< Bit mask for FFT_EN                         */
#define _FFT_EN_EN_DEFAULT                         0x00000000UL                         /**< Mode DEFAULT for FFT_EN                     */
#define FFT_EN_EN_DEFAULT                          (_FFT_EN_EN_DEFAULT << 0)            /**< Shifted mode DEFAULT for FFT_EN             */
#define FFT_EN_DISABLING                           (0x1UL << 1)                         /**< Disablement Busy Status                     */
#define _FFT_EN_DISABLING_SHIFT                    1                                    /**< Shift value for FFT_DISABLING               */
#define _FFT_EN_DISABLING_MASK                     0x2UL                                /**< Bit mask for FFT_DISABLING                  */
#define _FFT_EN_DISABLING_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for FFT_EN                     */
#define FFT_EN_DISABLING_DEFAULT                   (_FFT_EN_DISABLING_DEFAULT << 1)     /**< Shifted mode DEFAULT for FFT_EN             */

/* Bit fields for FFT SWRST */
#define _FFT_SWRST_RESETVALUE                      0x00000000UL                         /**< Default value for FFT_SWRST                 */
#define _FFT_SWRST_MASK                            0x00000003UL                         /**< Mask for FFT_SWRST                          */
#define FFT_SWRST_SWRST                            (0x1UL << 0)                         /**< Software Reset Command                      */
#define _FFT_SWRST_SWRST_SHIFT                     0                                    /**< Shift value for FFT_SWRST                   */
#define _FFT_SWRST_SWRST_MASK                      0x1UL                                /**< Bit mask for FFT_SWRST                      */
#define _FFT_SWRST_SWRST_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for FFT_SWRST                  */
#define FFT_SWRST_SWRST_DEFAULT                    (_FFT_SWRST_SWRST_DEFAULT << 0)      /**< Shifted mode DEFAULT for FFT_SWRST          */
#define FFT_SWRST_RESETTING                        (0x1UL << 1)                         /**< Software Reset Busy Status                  */
#define _FFT_SWRST_RESETTING_SHIFT                 1                                    /**< Shift value for FFT_RESETTING               */
#define _FFT_SWRST_RESETTING_MASK                  0x2UL                                /**< Bit mask for FFT_RESETTING                  */
#define _FFT_SWRST_RESETTING_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for FFT_SWRST                  */
#define FFT_SWRST_RESETTING_DEFAULT                (_FFT_SWRST_RESETTING_DEFAULT << 1)  /**< Shifted mode DEFAULT for FFT_SWRST          */

