SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fft.h
/* Bit fields for FFT CONNECT */
#define _FFT_CONNECT_RESETVALUE                    0x00000000UL                         /**< Default value for FFT_CONNECT               */
#define _FFT_CONNECT_MASK                          0x00000101UL                         /**< Mask for FFT_CONNECT                        */
#define FFT_CONNECT_IN                             (0x1UL << 0)                         /**< Input FIFO connect                          */
#define _FFT_CONNECT_IN_SHIFT                      0                                    /**< Shift value for FFT_IN                      */
#define _FFT_CONNECT_IN_MASK                       0x1UL                                /**< Bit mask for FFT_IN                         */
#define _FFT_CONNECT_IN_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for FFT_CONNECT                */
#define FFT_CONNECT_IN_DEFAULT                     (_FFT_CONNECT_IN_DEFAULT << 0)       /**< Shifted mode DEFAULT for FFT_CONNECT        */
#define FFT_CONNECT_OUT                            (0x1UL << 8)                         /**< Output FIFO connect                         */
#define _FFT_CONNECT_OUT_SHIFT                     8                                    /**< Shift value for FFT_OUT                     */
#define _FFT_CONNECT_OUT_MASK                      0x100UL                              /**< Bit mask for FFT_OUT                        */
#define _FFT_CONNECT_OUT_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for FFT_CONNECT                */
#define FFT_CONNECT_OUT_DEFAULT                    (_FFT_CONNECT_OUT_DEFAULT << 8)      /**< Shifted mode DEFAULT for FFT_CONNECT        */

/* Bit fields for FFT DISCLK */
#define _FFT_DISCLK_RESETVALUE                     0x00000002UL                         /**< Default value for FFT_DISCLK                */
#define _FFT_DISCLK_MASK                           0x00000003UL                         /**< Mask for FFT_DISCLK                         */
#define _FFT_DISCLK_DISCLK_SHIFT                   0                                    /**< Shift value for FFT_DISCLK                  */
#define _FFT_DISCLK_DISCLK_MASK                    0x3UL                                /**< Bit mask for FFT_DISCLK                     */
#define _FFT_DISCLK_DISCLK_DEFAULT                 0x00000002UL                         /**< Mode DEFAULT for FFT_DISCLK                 */
#define _FFT_DISCLK_DISCLK_NONE                    0x00000000UL                         /**< Mode NONE for FFT_DISCLK                    */
#define _FFT_DISCLK_DISCLK_ALL                     0x00000001UL                         /**< Mode ALL for FFT_DISCLK                     */
#define _FFT_DISCLK_DISCLK_AUTO                    0x00000002UL                         /**< Mode AUTO for FFT_DISCLK                    */
#define _FFT_DISCLK_DISCLK_NOTUSED                 0x00000003UL                         /**< Mode NOTUSED for FFT_DISCLK                 */
#define FFT_DISCLK_DISCLK_DEFAULT                  (_FFT_DISCLK_DISCLK_DEFAULT << 0)    /**< Shifted mode DEFAULT for FFT_DISCLK         */
#define FFT_DISCLK_DISCLK_NONE                     (_FFT_DISCLK_DISCLK_NONE << 0)       /**< Shifted mode NONE for FFT_DISCLK            */
#define FFT_DISCLK_DISCLK_ALL                      (_FFT_DISCLK_DISCLK_ALL << 0)        /**< Shifted mode ALL for FFT_DISCLK             */
#define FFT_DISCLK_DISCLK_AUTO                     (_FFT_DISCLK_DISCLK_AUTO << 0)       /**< Shifted mode AUTO for FFT_DISCLK            */
#define FFT_DISCLK_DISCLK_NOTUSED                  (_FFT_DISCLK_DISCLK_NOTUSED << 0)    /**< Shifted mode NOTUSED for FFT_DISCLK         */

/* Bit fields for FFT FIFOIN */
#define _FFT_FIFOIN_RESETVALUE                     0x00000000UL                         /**< Default value for FFT_FIFOIN                */
#define _FFT_FIFOIN_MASK                           0x1FFF3F0FUL                         /**< Mask for FFT_FIFOIN                         */
#define _FFT_FIFOIN_FID_SHIFT                      0                                    /**< Shift value for FFT_FID                     */
#define _FFT_FIFOIN_FID_MASK                       0xFUL                                /**< Bit mask for FFT_FID                        */
#define _FFT_FIFOIN_FID_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOIN                 */
#define FFT_FIFOIN_FID_DEFAULT                     (_FFT_FIFOIN_FID_DEFAULT << 0)       /**< Shifted mode DEFAULT for FFT_FIFOIN         */
#define _FFT_FIFOIN_CID_SHIFT                      8                                    /**< Shift value for FFT_CID                     */
#define _FFT_FIFOIN_CID_MASK                       0x3F00UL                             /**< Bit mask for FFT_CID                        */
#define _FFT_FIFOIN_CID_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOIN                 */
#define FFT_FIFOIN_CID_DEFAULT                     (_FFT_FIFOIN_CID_DEFAULT << 8)       /**< Shifted mode DEFAULT for FFT_FIFOIN         */
#define _FFT_FIFOIN_REM_SHIFT                      16                                   /**< Shift value for FFT_REM                     */
#define _FFT_FIFOIN_REM_MASK                       0xFF0000UL                           /**< Bit mask for FFT_REM                        */
#define _FFT_FIFOIN_REM_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOIN                 */
#define FFT_FIFOIN_REM_DEFAULT                     (_FFT_FIFOIN_REM_DEFAULT << 16)      /**< Shifted mode DEFAULT for FFT_FIFOIN         */
#define _FFT_FIFOIN_ALARM_SHIFT                    24                                   /**< Shift value for FFT_ALARM                   */
#define _FFT_FIFOIN_ALARM_MASK                     0x1F000000UL                         /**< Bit mask for FFT_ALARM                      */
#define _FFT_FIFOIN_ALARM_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOIN                 */
#define FFT_FIFOIN_ALARM_DEFAULT                   (_FFT_FIFOIN_ALARM_DEFAULT << 24)    /**< Shifted mode DEFAULT for FFT_FIFOIN         */

/* Bit fields for FFT FIFOOUT */
#define _FFT_FIFOOUT_RESETVALUE                    0x00000000UL                         /**< Default value for FFT_FIFOOUT               */
#define _FFT_FIFOOUT_MASK                          0x1FFF0000UL                         /**< Mask for FFT_FIFOOUT                        */
#define _FFT_FIFOOUT_CNT_SHIFT                     16                                   /**< Shift value for FFT_CNT                     */
#define _FFT_FIFOOUT_CNT_MASK                      0xFF0000UL                           /**< Bit mask for FFT_CNT                        */
#define _FFT_FIFOOUT_CNT_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOOUT                */
#define FFT_FIFOOUT_CNT_DEFAULT                    (_FFT_FIFOOUT_CNT_DEFAULT << 16)     /**< Shifted mode DEFAULT for FFT_FIFOOUT        */
#define _FFT_FIFOOUT_ALARM_SHIFT                   24                                   /**< Shift value for FFT_ALARM                   */
#define _FFT_FIFOOUT_ALARM_MASK                    0x1F000000UL                         /**< Bit mask for FFT_ALARM                      */
#define _FFT_FIFOOUT_ALARM_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for FFT_FIFOOUT                */
#define FFT_FIFOOUT_ALARM_DEFAULT                  (_FFT_FIFOOUT_ALARM_DEFAULT << 24)   /**< Shifted mode DEFAULT for FFT_FIFOOUT        */

/* Bit fields for FFT FMTIN */
#define _FFT_FMTIN_RESETVALUE                      0x00000000UL                          /**< Default value for FFT_FMTIN                 */
#define _FFT_FMTIN_MASK                            0x00030300UL                          /**< Mask for FFT_FMTIN                          */
#define _FFT_FMTIN_ELEMNB_SHIFT                    8                                     /**< Shift value for FFT_ELEMNB                  */
#define _FFT_FMTIN_ELEMNB_MASK                     0x300UL                               /**< Bit mask for FFT_ELEMNB                     */
#define _FFT_FMTIN_ELEMNB_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for FFT_FMTIN                  */
#define _FFT_FMTIN_ELEMNB_ONE                      0x00000000UL                          /**< Mode ONE for FFT_FMTIN                      */
#define _FFT_FMTIN_ELEMNB_TWO                      0x00000001UL                          /**< Mode TWO for FFT_FMTIN                      */
#define _FFT_FMTIN_ELEMNB_FOUR                     0x00000002UL                          /**< Mode FOUR for FFT_FMTIN                     */
#define FFT_FMTIN_ELEMNB_DEFAULT                   (_FFT_FMTIN_ELEMNB_DEFAULT << 8)      /**< Shifted mode DEFAULT for FFT_FMTIN          */
#define FFT_FMTIN_ELEMNB_ONE                       (_FFT_FMTIN_ELEMNB_ONE << 8)          /**< Shifted mode ONE for FFT_FMTIN              */
#define FFT_FMTIN_ELEMNB_TWO                       (_FFT_FMTIN_ELEMNB_TWO << 8)          /**< Shifted mode TWO for FFT_FMTIN              */
#define FFT_FMTIN_ELEMNB_FOUR                      (_FFT_FMTIN_ELEMNB_FOUR << 8)         /**< Shifted mode FOUR for FFT_FMTIN             */
#define _FFT_FMTIN_ELEMALIGN_SHIFT                 16                                    /**< Shift value for FFT_ELEMALIGN               */
#define _FFT_FMTIN_ELEMALIGN_MASK                  0x30000UL                             /**< Bit mask for FFT_ELEMALIGN                  */
#define _FFT_FMTIN_ELEMALIGN_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for FFT_FMTIN                  */
#define _FFT_FMTIN_ELEMALIGN_WORD                  0x00000000UL                          /**< Mode WORD for FFT_FMTIN                     */
#define _FFT_FMTIN_ELEMALIGN_HALFWORD              0x00000001UL                          /**< Mode HALFWORD for FFT_FMTIN                 */
#define _FFT_FMTIN_ELEMALIGN_BYTE                  0x00000002UL                          /**< Mode BYTE for FFT_FMTIN                     */
#define FFT_FMTIN_ELEMALIGN_DEFAULT                (_FFT_FMTIN_ELEMALIGN_DEFAULT << 16)  /**< Shifted mode DEFAULT for FFT_FMTIN          */
#define FFT_FMTIN_ELEMALIGN_WORD                   (_FFT_FMTIN_ELEMALIGN_WORD << 16)     /**< Shifted mode WORD for FFT_FMTIN             */
#define FFT_FMTIN_ELEMALIGN_HALFWORD               (_FFT_FMTIN_ELEMALIGN_HALFWORD << 16) /**< Shifted mode HALFWORD for FFT_FMTIN         */
#define FFT_FMTIN_ELEMALIGN_BYTE                   (_FFT_FMTIN_ELEMALIGN_BYTE << 16)     /**< Shifted mode BYTE for FFT_FMTIN             */

/* Bit fields for FFT FMTOUT */
#define _FFT_FMTOUT_RESETVALUE                     0x0000000DUL                           /**< Default value for FFT_FMTOUT                */
#define _FFT_FMTOUT_MASK                           0x0003001FUL                           /**< Mask for FFT_FMTOUT                         */
#define _FFT_FMTOUT_ELEMSIZE_SHIFT                 0                                      /**< Shift value for FFT_ELEMSIZE                */
#define _FFT_FMTOUT_ELEMSIZE_MASK                  0x1FUL                                 /**< Bit mask for FFT_ELEMSIZE                   */
#define _FFT_FMTOUT_ELEMSIZE_DEFAULT               0x0000000DUL                           /**< Mode DEFAULT for FFT_FMTOUT                 */
#define FFT_FMTOUT_ELEMSIZE_DEFAULT                (_FFT_FMTOUT_ELEMSIZE_DEFAULT << 0)    /**< Shifted mode DEFAULT for FFT_FMTOUT         */
#define _FFT_FMTOUT_ELEMALIGN_SHIFT                16                                     /**< Shift value for FFT_ELEMALIGN               */
#define _FFT_FMTOUT_ELEMALIGN_MASK                 0x30000UL                              /**< Bit mask for FFT_ELEMALIGN                  */
#define _FFT_FMTOUT_ELEMALIGN_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for FFT_FMTOUT                 */
#define _FFT_FMTOUT_ELEMALIGN_WORD                 0x00000000UL                           /**< Mode WORD for FFT_FMTOUT                    */
#define _FFT_FMTOUT_ELEMALIGN_HALFWORD             0x00000001UL                           /**< Mode HALFWORD for FFT_FMTOUT                */
#define _FFT_FMTOUT_ELEMALIGN_BYTE                 0x00000002UL                           /**< Mode BYTE for FFT_FMTOUT                    */
#define FFT_FMTOUT_ELEMALIGN_DEFAULT               (_FFT_FMTOUT_ELEMALIGN_DEFAULT << 16)  /**< Shifted mode DEFAULT for FFT_FMTOUT         */
#define FFT_FMTOUT_ELEMALIGN_WORD                  (_FFT_FMTOUT_ELEMALIGN_WORD << 16)     /**< Shifted mode WORD for FFT_FMTOUT            */
#define FFT_FMTOUT_ELEMALIGN_HALFWORD              (_FFT_FMTOUT_ELEMALIGN_HALFWORD << 16) /**< Shifted mode HALFWORD for FFT_FMTOUT        */
#define FFT_FMTOUT_ELEMALIGN_BYTE                  (_FFT_FMTOUT_ELEMALIGN_BYTE << 16)     /**< Shifted mode BYTE for FFT_FMTOUT            */

