SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fft.h
/* Bit fields for FFT CTRL */
#define _FFT_CTRL_RESETVALUE                       0x0038080EUL                                    /**< Default value for FFT_CTRL                  */
#define _FFT_CTRL_MASK                             0xFFFFFFFFUL                                    /**< Mask for FFT_CTRL                           */
#define FFT_CTRL_MODE                              (0x1UL << 0)                                    /**< New BitField                                */
#define _FFT_CTRL_MODE_SHIFT                       0                                               /**< Shift value for FFT_MODE                    */
#define _FFT_CTRL_MODE_MASK                        0x1UL                                           /**< Bit mask for FFT_MODE                       */
#define _FFT_CTRL_MODE_DEFAULT                     0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_MODE_FORWARD                     0x00000000UL                                    /**< Mode FORWARD for FFT_CTRL                   */
#define _FFT_CTRL_MODE_BACKWARD                    0x00000001UL                                    /**< Mode BACKWARD for FFT_CTRL                  */
#define FFT_CTRL_MODE_DEFAULT                      (_FFT_CTRL_MODE_DEFAULT << 0)                   /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_MODE_FORWARD                      (_FFT_CTRL_MODE_FORWARD << 0)                   /**< Shifted mode FORWARD for FFT_CTRL           */
#define FFT_CTRL_MODE_BACKWARD                     (_FFT_CTRL_MODE_BACKWARD << 0)                  /**< Shifted mode BACKWARD for FFT_CTRL          */
#define _FFT_CTRL_SIZE_SHIFT                       1                                               /**< Shift value for FFT_SIZE                    */
#define _FFT_CTRL_SIZE_MASK                        0x1EUL                                          /**< Bit mask for FFT_SIZE                       */
#define _FFT_CTRL_SIZE_DEFAULT                     0x00000007UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_SIZE_FFT16                       0x00000004UL                                    /**< Mode FFT16 for FFT_CTRL                     */
#define _FFT_CTRL_SIZE_FFT32                       0x00000005UL                                    /**< Mode FFT32 for FFT_CTRL                     */
#define _FFT_CTRL_SIZE_FFT64                       0x00000006UL                                    /**< Mode FFT64 for FFT_CTRL                     */
#define _FFT_CTRL_SIZE_FFT128                      0x00000007UL                                    /**< Mode FFT128 for FFT_CTRL                    */
#define _FFT_CTRL_SIZE_FFT256                      0x00000008UL                                    /**< Mode FFT256 for FFT_CTRL                    */
#define _FFT_CTRL_SIZE_FFT512                      0x00000009UL                                    /**< Mode FFT512 for FFT_CTRL                    */
#define FFT_CTRL_SIZE_DEFAULT                      (_FFT_CTRL_SIZE_DEFAULT << 1)                   /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_SIZE_FFT16                        (_FFT_CTRL_SIZE_FFT16 << 1)                     /**< Shifted mode FFT16 for FFT_CTRL             */
#define FFT_CTRL_SIZE_FFT32                        (_FFT_CTRL_SIZE_FFT32 << 1)                     /**< Shifted mode FFT32 for FFT_CTRL             */
#define FFT_CTRL_SIZE_FFT64                        (_FFT_CTRL_SIZE_FFT64 << 1)                     /**< Shifted mode FFT64 for FFT_CTRL             */
#define FFT_CTRL_SIZE_FFT128                       (_FFT_CTRL_SIZE_FFT128 << 1)                    /**< Shifted mode FFT128 for FFT_CTRL            */
#define FFT_CTRL_SIZE_FFT256                       (_FFT_CTRL_SIZE_FFT256 << 1)                    /**< Shifted mode FFT256 for FFT_CTRL            */
#define FFT_CTRL_SIZE_FFT512                       (_FFT_CTRL_SIZE_FFT512 << 1)                    /**< Shifted mode FFT512 for FFT_CTRL            */
#define FFT_CTRL_RSTFSM                            (0x1UL << 5)                                    /**< New BitField                                */
#define _FFT_CTRL_RSTFSM_SHIFT                     5                                               /**< Shift value for FFT_RSTFSM                  */
#define _FFT_CTRL_RSTFSM_MASK                      0x20UL                                          /**< Bit mask for FFT_RSTFSM                     */
#define _FFT_CTRL_RSTFSM_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define FFT_CTRL_RSTFSM_DEFAULT                    (_FFT_CTRL_RSTFSM_DEFAULT << 5)                 /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_RSTSTAT                           (0x1UL << 6)                                    /**< New BitField                                */
#define _FFT_CTRL_RSTSTAT_SHIFT                    6                                               /**< Shift value for FFT_RSTSTAT                 */
#define _FFT_CTRL_RSTSTAT_MASK                     0x40UL                                          /**< Bit mask for FFT_RSTSTAT                    */
#define _FFT_CTRL_RSTSTAT_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define FFT_CTRL_RSTSTAT_DEFAULT                   (_FFT_CTRL_RSTSTAT_DEFAULT << 6)                /**< Shifted mode DEFAULT for FFT_CTRL           */
#define _FFT_CTRL_GAIN_SHIFT                       7                                               /**< Shift value for FFT_GAIN                    */
#define _FFT_CTRL_GAIN_MASK                        0x1FF80UL                                       /**< Bit mask for FFT_GAIN                       */
#define _FFT_CTRL_GAIN_DEFAULT                     0x00000010UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define FFT_CTRL_GAIN_DEFAULT                      (_FFT_CTRL_GAIN_DEFAULT << 7)                   /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_SWAPIQIN                          (0x1UL << 17)                                   /**< New BitField                                */
#define _FFT_CTRL_SWAPIQIN_SHIFT                   17                                              /**< Shift value for FFT_SWAPIQIN                */
#define _FFT_CTRL_SWAPIQIN_MASK                    0x20000UL                                       /**< Bit mask for FFT_SWAPIQIN                   */
#define _FFT_CTRL_SWAPIQIN_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_SWAPIQIN_NO                      0x00000000UL                                    /**< Mode NO for FFT_CTRL                        */
#define _FFT_CTRL_SWAPIQIN_YES                     0x00000001UL                                    /**< Mode YES for FFT_CTRL                       */
#define FFT_CTRL_SWAPIQIN_DEFAULT                  (_FFT_CTRL_SWAPIQIN_DEFAULT << 17)              /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_SWAPIQIN_NO                       (_FFT_CTRL_SWAPIQIN_NO << 17)                   /**< Shifted mode NO for FFT_CTRL                */
#define FFT_CTRL_SWAPIQIN_YES                      (_FFT_CTRL_SWAPIQIN_YES << 17)                  /**< Shifted mode YES for FFT_CTRL               */
#define FFT_CTRL_SWAPIQOUT                         (0x1UL << 18)                                   /**< New BitField                                */
#define _FFT_CTRL_SWAPIQOUT_SHIFT                  18                                              /**< Shift value for FFT_SWAPIQOUT               */
#define _FFT_CTRL_SWAPIQOUT_MASK                   0x40000UL                                       /**< Bit mask for FFT_SWAPIQOUT                  */
#define _FFT_CTRL_SWAPIQOUT_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_SWAPIQOUT_NO                     0x00000000UL                                    /**< Mode NO for FFT_CTRL                        */
#define _FFT_CTRL_SWAPIQOUT_YES                    0x00000001UL                                    /**< Mode YES for FFT_CTRL                       */
#define FFT_CTRL_SWAPIQOUT_DEFAULT                 (_FFT_CTRL_SWAPIQOUT_DEFAULT << 18)             /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_SWAPIQOUT_NO                      (_FFT_CTRL_SWAPIQOUT_NO << 18)                  /**< Shifted mode NO for FFT_CTRL                */
#define FFT_CTRL_SWAPIQOUT_YES                     (_FFT_CTRL_SWAPIQOUT_YES << 18)                 /**< Shifted mode YES for FFT_CTRL               */
#define FFT_CTRL_SPECTRUMSHIFT                     (0x1UL << 19)                                   /**< New BitField                                */
#define _FFT_CTRL_SPECTRUMSHIFT_SHIFT              19                                              /**< Shift value for FFT_SPECTRUMSHIFT           */
#define _FFT_CTRL_SPECTRUMSHIFT_MASK               0x80000UL                                       /**< Bit mask for FFT_SPECTRUMSHIFT              */
#define _FFT_CTRL_SPECTRUMSHIFT_DEFAULT            0x00000001UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_SPECTRUMSHIFT_NoSpectrumShift    0x00000000UL                                    /**< Mode NoSpectrumShift for FFT_CTRL           */
#define _FFT_CTRL_SPECTRUMSHIFT_SpectrumShift      0x00000001UL                                    /**< Mode SpectrumShift for FFT_CTRL             */
#define FFT_CTRL_SPECTRUMSHIFT_DEFAULT             (_FFT_CTRL_SPECTRUMSHIFT_DEFAULT << 19)         /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_SPECTRUMSHIFT_NoSpectrumShift     (_FFT_CTRL_SPECTRUMSHIFT_NoSpectrumShift << 19) /**< Shifted mode NoSpectrumShift for FFT_CTRL   */
#define FFT_CTRL_SPECTRUMSHIFT_SpectrumShift       (_FFT_CTRL_SPECTRUMSHIFT_SpectrumShift << 19)   /**< Shifted mode SpectrumShift for FFT_CTRL     */
#define FFT_CTRL_INVQINPUT                         (0x1UL << 20)                                   /**< New BitField                                */
#define _FFT_CTRL_INVQINPUT_SHIFT                  20                                              /**< Shift value for FFT_INVQINPUT               */
#define _FFT_CTRL_INVQINPUT_MASK                   0x100000UL                                      /**< Bit mask for FFT_INVQINPUT                  */
#define _FFT_CTRL_INVQINPUT_DEFAULT                0x00000001UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_INVQINPUT_NoInversion            0x00000000UL                                    /**< Mode NoInversion for FFT_CTRL               */
#define _FFT_CTRL_INVQINPUT_Inversion              0x00000001UL                                    /**< Mode Inversion for FFT_CTRL                 */
#define FFT_CTRL_INVQINPUT_DEFAULT                 (_FFT_CTRL_INVQINPUT_DEFAULT << 20)             /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_INVQINPUT_NoInversion             (_FFT_CTRL_INVQINPUT_NoInversion << 20)         /**< Shifted mode NoInversion for FFT_CTRL       */
#define FFT_CTRL_INVQINPUT_Inversion               (_FFT_CTRL_INVQINPUT_Inversion << 20)           /**< Shifted mode Inversion for FFT_CTRL         */
#define FFT_CTRL_INVQOUTPUT                        (0x1UL << 21)                                   /**< New BitField                                */
#define _FFT_CTRL_INVQOUTPUT_SHIFT                 21                                              /**< Shift value for FFT_INVQOUTPUT              */
#define _FFT_CTRL_INVQOUTPUT_MASK                  0x200000UL                                      /**< Bit mask for FFT_INVQOUTPUT                 */
#define _FFT_CTRL_INVQOUTPUT_DEFAULT               0x00000001UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_INVQOUTPUT_NoInversion           0x00000000UL                                    /**< Mode NoInversion for FFT_CTRL               */
#define _FFT_CTRL_INVQOUTPUT_Inversion             0x00000001UL                                    /**< Mode Inversion for FFT_CTRL                 */
#define FFT_CTRL_INVQOUTPUT_DEFAULT                (_FFT_CTRL_INVQOUTPUT_DEFAULT << 21)            /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_INVQOUTPUT_NoInversion            (_FFT_CTRL_INVQOUTPUT_NoInversion << 21)        /**< Shifted mode NoInversion for FFT_CTRL       */
#define FFT_CTRL_INVQOUTPUT_Inversion              (_FFT_CTRL_INVQOUTPUT_Inversion << 21)          /**< Shifted mode Inversion for FFT_CTRL         */
#define FFT_CTRL_OUTFORMAT                         (0x1UL << 22)                                   /**< New BitField                                */
#define _FFT_CTRL_OUTFORMAT_SHIFT                  22                                              /**< Shift value for FFT_OUTFORMAT               */
#define _FFT_CTRL_OUTFORMAT_MASK                   0x400000UL                                      /**< Bit mask for FFT_OUTFORMAT                  */
#define _FFT_CTRL_OUTFORMAT_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_OUTFORMAT_IQ                     0x00000000UL                                    /**< Mode IQ for FFT_CTRL                        */
#define _FFT_CTRL_OUTFORMAT_SQMODULEIQ             0x00000001UL                                    /**< Mode SQMODULEIQ for FFT_CTRL                */
#define FFT_CTRL_OUTFORMAT_DEFAULT                 (_FFT_CTRL_OUTFORMAT_DEFAULT << 22)             /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_OUTFORMAT_IQ                      (_FFT_CTRL_OUTFORMAT_IQ << 22)                  /**< Shifted mode IQ for FFT_CTRL                */
#define FFT_CTRL_OUTFORMAT_SQMODULEIQ              (_FFT_CTRL_OUTFORMAT_SQMODULEIQ << 22)          /**< Shifted mode SQMODULEIQ for FFT_CTRL        */
#define _FFT_CTRL_SHIFTOUT_SHIFT                   23                                              /**< Shift value for FFT_SHIFTOUT                */
#define _FFT_CTRL_SHIFTOUT_MASK                    0x7F800000UL                                    /**< Bit mask for FFT_SHIFTOUT                   */
#define _FFT_CTRL_SHIFTOUT_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define FFT_CTRL_SHIFTOUT_DEFAULT                  (_FFT_CTRL_SHIFTOUT_DEFAULT << 23)              /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_DEBUG                             (0x1UL << 31)                                   /**< New BitField                                */
#define _FFT_CTRL_DEBUG_SHIFT                      31                                              /**< Shift value for FFT_DEBUG                   */
#define _FFT_CTRL_DEBUG_MASK                       0x80000000UL                                    /**< Bit mask for FFT_DEBUG                      */
#define _FFT_CTRL_DEBUG_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for FFT_CTRL                   */
#define _FFT_CTRL_DEBUG_NO                         0x00000000UL                                    /**< Mode NO for FFT_CTRL                        */
#define _FFT_CTRL_DEBUG_YES                        0x00000001UL                                    /**< Mode YES for FFT_CTRL                       */
#define FFT_CTRL_DEBUG_DEFAULT                     (_FFT_CTRL_DEBUG_DEFAULT << 31)                 /**< Shifted mode DEFAULT for FFT_CTRL           */
#define FFT_CTRL_DEBUG_NO                          (_FFT_CTRL_DEBUG_NO << 31)                      /**< Shifted mode NO for FFT_CTRL                */
#define FFT_CTRL_DEBUG_YES                         (_FFT_CTRL_DEBUG_YES << 31)                     /**< Shifted mode YES for FFT_CTRL               */

/* Bit fields for FFT CTRL2 */
#define _FFT_CTRL2_RESETVALUE                      0x00000000UL                            /**< Default value for FFT_CTRL2                 */
#define _FFT_CTRL2_MASK                            0x00003003UL                            /**< Mask for FFT_CTRL2                          */
#define _FFT_CTRL2_STATUS_SHIFT                    0                                       /**< Shift value for FFT_STATUS                  */
#define _FFT_CTRL2_STATUS_MASK                     0x3UL                                   /**< Bit mask for FFT_STATUS                     */
#define _FFT_CTRL2_STATUS_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for FFT_CTRL2                  */
#define _FFT_CTRL2_STATUS_SLEEP                    0x00000000UL                            /**< Mode SLEEP for FFT_CTRL2                    */
#define _FFT_CTRL2_STATUS_COMPUTING                0x00000001UL                            /**< Mode COMPUTING for FFT_CTRL2                */
#define _FFT_CTRL2_STATUS_UNUSED                   0x00000002UL                            /**< Mode UNUSED for FFT_CTRL2                   */
#define _FFT_CTRL2_STATUS_READING                  0x00000003UL                            /**< Mode READING for FFT_CTRL2                  */
#define FFT_CTRL2_STATUS_DEFAULT                   (_FFT_CTRL2_STATUS_DEFAULT << 0)        /**< Shifted mode DEFAULT for FFT_CTRL2          */
#define FFT_CTRL2_STATUS_SLEEP                     (_FFT_CTRL2_STATUS_SLEEP << 0)          /**< Shifted mode SLEEP for FFT_CTRL2            */
#define FFT_CTRL2_STATUS_COMPUTING                 (_FFT_CTRL2_STATUS_COMPUTING << 0)      /**< Shifted mode COMPUTING for FFT_CTRL2        */
#define FFT_CTRL2_STATUS_UNUSED                    (_FFT_CTRL2_STATUS_UNUSED << 0)         /**< Shifted mode UNUSED for FFT_CTRL2           */
#define FFT_CTRL2_STATUS_READING                   (_FFT_CTRL2_STATUS_READING << 0)        /**< Shifted mode READING for FFT_CTRL2          */
#define _FFT_CTRL2_UPSAMP_SHIFT                    12                                      /**< Shift value for FFT_UPSAMP                  */
#define _FFT_CTRL2_UPSAMP_MASK                     0x3000UL                                /**< Bit mask for FFT_UPSAMP                     */
#define _FFT_CTRL2_UPSAMP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for FFT_CTRL2                  */
#define _FFT_CTRL2_UPSAMP_NoUpsampling             0x00000000UL                            /**< Mode NoUpsampling for FFT_CTRL2             */
#define _FFT_CTRL2_UPSAMP_Upsamplingby2            0x00000001UL                            /**< Mode Upsamplingby2 for FFT_CTRL2            */
#define _FFT_CTRL2_UPSAMP_Upsamplingby4            0x00000002UL                            /**< Mode Upsamplingby4 for FFT_CTRL2            */
#define _FFT_CTRL2_UPSAMP_Upsamplingby8            0x00000003UL                            /**< Mode Upsamplingby8 for FFT_CTRL2            */
#define FFT_CTRL2_UPSAMP_DEFAULT                   (_FFT_CTRL2_UPSAMP_DEFAULT << 12)       /**< Shifted mode DEFAULT for FFT_CTRL2          */
#define FFT_CTRL2_UPSAMP_NoUpsampling              (_FFT_CTRL2_UPSAMP_NoUpsampling << 12)  /**< Shifted mode NoUpsampling for FFT_CTRL2     */
#define FFT_CTRL2_UPSAMP_Upsamplingby2             (_FFT_CTRL2_UPSAMP_Upsamplingby2 << 12) /**< Shifted mode Upsamplingby2 for FFT_CTRL2    */
#define FFT_CTRL2_UPSAMP_Upsamplingby4             (_FFT_CTRL2_UPSAMP_Upsamplingby4 << 12) /**< Shifted mode Upsamplingby4 for FFT_CTRL2    */
#define FFT_CTRL2_UPSAMP_Upsamplingby8             (_FFT_CTRL2_UPSAMP_Upsamplingby8 << 12) /**< Shifted mode Upsamplingby8 for FFT_CTRL2    */

/* Bit fields for FFT IF */
#define _FFT_IF_RESETVALUE                         0x00000000UL                         /**< Default value for FFT_IF                    */
#define _FFT_IF_MASK                               0x00000001UL                         /**< Mask for FFT_IF                             */
#define FFT_IF_DONE                                (0x1UL << 0)                         /**< New BitField                                */
#define _FFT_IF_DONE_SHIFT                         0                                    /**< Shift value for FFT_DONE                    */
#define _FFT_IF_DONE_MASK                          0x1UL                                /**< Bit mask for FFT_DONE                       */
#define _FFT_IF_DONE_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FFT_IF                     */
#define FFT_IF_DONE_DEFAULT                        (_FFT_IF_DONE_DEFAULT << 0)          /**< Shifted mode DEFAULT for FFT_IF             */

/* Bit fields for FFT IEN */
#define _FFT_IEN_RESETVALUE                        0x00000000UL                         /**< Default value for FFT_IEN                   */
#define _FFT_IEN_MASK                              0x00000001UL                         /**< Mask for FFT_IEN                            */
#define FFT_IEN_DONE                               (0x1UL << 0)                         /**< New BitField                                */
#define _FFT_IEN_DONE_SHIFT                        0                                    /**< Shift value for FFT_DONE                    */
#define _FFT_IEN_DONE_MASK                         0x1UL                                /**< Bit mask for FFT_DONE                       */
#define _FFT_IEN_DONE_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for FFT_IEN                    */
#define FFT_IEN_DONE_DEFAULT                       (_FFT_IEN_DONE_DEFAULT << 0)         /**< Shifted mode DEFAULT for FFT_IEN            */

/** @} End of group EFR32FG25_FFT_BitFields */
/** @} End of group EFR32FG25_FFT */
/** @} End of group Parts */

#endif /* EFR32FG25_FFT_H */
